google.charts.load("current", { packages: ["corechart"] });
google.charts.setOnLoadCallback(drawChart);

function drawChart() {
    var data = google.visualization.arrayToDataTable([
        ['กระทรวง', 'งบประมาณในปี 2562'],
        ['สำนักนายกรัฐมนตรี',204800],
        ['กระทรวงการคลัง',121002000],
        ['กระทรวงการท่องเที่ยวและกีฬา',270100],
        ['กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์',17887200],
        ['กระทรวงเกษตรและสหกรณ์',275074900],
        ['กระทรวงคมนาคม',1679467900],
        ['กระทรวงดิจิทัลเพ่ือเศรษฐกิจและสังคม',377487000],
        ['กระทรวงพลังงาน',153000],
        ['กระทรวงพาณิชย์',1390000],
        ['กระทรวงมหาดไทย',46642300],
        ['กระทรวงยุติธรรม',56394700],
        ['กระทรวงแรงงาน',18914300],
        ['กระทรวงวัฒนธรรม',56000],
        ['กระทรวงศึกษาธิการ',1583138134],
        ['กระทรวงสาธารณสุข',114674800],
        ['กระทรวงอุตสาหกรรม',20860600],
        ['หน่วยงานขององคก์รอิสระและองค์กรอัยการ',135200],
        ['รัฐวิสาหกิจ',303254600]

    ]);

    var options = {
        title: 'งบประมาณแบ่งตามกระทรวง',
        pieHole: 0.5,
        width: 900,
        height: 500
    };

    data.sort([{ column: 1 }]);

    var chart = new google.visualization.PieChart(document.getElementById('ministry_pie'));
    chart.draw(data, options);
}
